Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Save the user name in a JWT token encrypted with the current OIDC tenant's client secret.
ja_jp: 現在の OIDC テナントのクライアントシークレットで暗号化された JWT トークンにユーザー名を保存します。

source: Save this SAML integration and note its Metadata URL:
ja_jp: この SAML インテグレーションを保存し、その Metadata URL をメモします。

source: Save this file in `src/main/docker/Dockerfile.multistage` as it is not included in the getting started quickstart.
ja_jp: このファイルは、Getting started quickstartには含まれていないので、 `src/main/docker/Dockerfile.multistage` に保存してください。

source: Say there is a Quarkus extension that among other things declares a few CDI beans like the following code does:
ja_jp: 以下のコードのようにいくつかの CDI Bean を宣言する Quarkus エクステンションがあるとします。

source: Say there is a Quarkus extension that, among other things, declares a few CDI beans like the following code does:
ja_jp: 例えば、Quarkus エクステンションが、次のような CDI Bean をいくつか宣言しているとします。

source: Scalability & Performance
ja_jp: スケーラビリティとパフォーマンス

source: Scale from prototype to production on cloud or on-prem.
ja_jp: プロトタイプからクラウドまたはオンプレミスの本番環境へとスケールする。

source: Scaling
ja_jp: スケーリング

source: Scaling Out
ja_jp: スケールアウト

source: Scanning Deployments Using Jandex
ja_jp: Jandex を使用したデプロイメントのスキャン

source: Scenario
ja_jp: シナリオ

source: Schedule a new job using the Quartz API.
ja_jp: Quartz APIを使用して新しいジョブをスケジュールします。

source: Schedule jobs and tasks
ja_jp: ジョブとタスクをスケジュールする

source: Scheduled Methods
ja_jp: スケジュールされたメソッド

source: Scheduled Methods and Testing
ja_jp: スケジュールされたメソッドとテスト

source: Scheduled Podcasts
ja_jp: スケジュールされたポッドキャスト

source: Scheduled method only delegates the job to the custom executor - this prevent Vert.x thread from being blocked.
ja_jp: スケジューリングされたメソッドは、ジョブをカスタムエグゼキュータに委譲するだけです。これにより、Vert.xスレッドがブロックされるのを防ぎます。

source: Scheduler
ja_jp: スケジューラー

source: Scheduler - tasks
ja_jp: スケジューラー - タスク

source: Scheduler Configuration Reference
ja_jp: スケジューラー設定リファレンス

source: Scheduler Injection Example
ja_jp: スケジューラーインジェクションの例

source: Scheduler Reference
ja_jp: スケジューラリファレンス

source: Scheduler Reference Guide
ja_jp: スケジューラーリファレンスガイド

source: Scheduling Clustered Tasks with Quartz
ja_jp: Quartzでクラスタ化されたタスクをスケジューリング

source: Scheduling Jobs Programmatically
ja_jp: プログラムによるジョブのスケジューリング

source: Scheduling Long-Running Tasks
ja_jp: 長時間タスクのスケジューリング

source: Scheduling Periodic Tasks
ja_jp: 定期的なタスクのスケジューリング

source: Scheduling Periodic Tasks with Quartz
ja_jp: Quartzによる定期的なタスクのスケジューリング

source: Schema ID Format Change
ja_jp: スキーマ ID 形式の変更

source: Schema Migration with Flyway
ja_jp: Flywayによるスキーマのマイグレーション

source: Schema Migration with Liquibase
ja_jp: Liquibase を使ったスキーマのマイグレーション

source: Schema for tenant `base` (`src/main/resources/database/base/V1.0.0__create_fruits.sql`):
ja_jp: テナント `base` のスキーマ (`src/main/resources/database/base/V1.0.0__create_fruits.sql`):

source: Schema for tenant `mycompany` (`src/main/resources/database/mycompany/V1.0.0__create_fruits.sql`):
ja_jp: テナント `mycompany` のスキーマ (`src/main/resources/database/mycompany/V1.0.0__create_fruits.sql`):

source: Schema migration with Liquibase
ja_jp: Liquibaseによるスキーママイグレーション

source: Scoop - for Windows
ja_jp: Scoop - Windows 向け

source: Scope separator
ja_jp: スコープセパレーター

source: Scope: one or more per backend.
ja_jp: スコープ: バックエンドごとに 1 つ以上。

source: Scope: one or more per persistence unit.
ja_jp: スコープ: 永続性ユニットごとに 1 つ以上。

source: Scope: one per application.
ja_jp: スコープ: アプリケーションごとに 1 つ。

source: Scope: one per backend.
ja_jp: スコープ: バックエンドごとに 1 つ。

source: Scope: one per persistence unit.
ja_jp: スコープ: 永続性ユニットごとに 1 つ。

source: Scope: values are ignored
ja_jp: スコープ：値は無視される

source: Scopes and contexts
ja_jp: スコープとコンテキスト

source: Scopes and contexts; see xref:cdi.adoc#bean-scope-available[here] for details
ja_jp: スコープとコンテキスト、詳しくは xref:cdi.adoc#bean-scope-available[こちら]

source: Scoring system
ja_jp: スコアリングシステム

source: Scratch image support is experimental.
ja_jp: スクラッチベースイメージのサポートは実験的なものです。

source: Scratch images should not be used in production without rigorous testing.
ja_jp: スクラッチイメージを本番環境で使用する場合は、必ず厳密なテストを実施してください。

source: Scratch pad
ja_jp: スクラッチパッド

source: Scripting with Quarkus
ja_jp: Quarkus によるスクリプティング

source: Scripting with jbang
ja_jp: jbangを使ったスクリプト

source: Seamless integration with Consul via build-time processing
ja_jp: ビルド時処理による Consul とのシームレスな統合

source: Seamlessly build container optimal
ja_jp: シームレスに最適なコンテナーを構築

source: Season 3 and 60th Insights episode
ja_jp: シーズン3、60回目のインサイトエピソード

source: Seasoned reactive developers may wonder why Quarkus introduced yet another reactive programming APIs while there are existing ones. Mutiny is taking a very different angle:
ja_jp: 熟練したリアクティブ開発者は、既存のリアクティブプログラミングAPIがあるにもかかわらず、Quarkusがまた新たなリアクティブプログラミングAPIを導入したことを不思議に思うかもしれません。しかし、Mutinyはまったく異なる角度からアプローチしています。

source: Second Level Cache
ja_jp: L2キャッシュ

source: Second, `cacerts`, the certificate store. You may need to periodically obtain an updated copy, also.
ja_jp: 2つ目は、 `cacerts` (証明書ストア)です。また、定期的に更新されたコピーを取得する必要があるかもしれません。

source: Second, cacerts, the certificate store. You may need to periodically obtain an updated copy, also.
ja_jp: 2つ目は、cacerts(証明書ストア)です。また、定期的に更新されたコピーを取得する必要があるかもしれません。

source: Second, it reduces memory consumption as it decreases the usage of threads.
ja_jp: 第 2 に、スレッドの使用量が減るため、メモリーの消費量を減らすことができます。

source: Second, of the thread allocation stacks, the ones under `start_thread` are particularly revealing. In this environment, taking into account the `-Xmx` value passed in, Quarkus creates 12 event loop threads. Aside from those, there are 6 extra threads. The names of all those 18 threads exceed 16 characters. This can be observed via the `ps` command:
ja_jp: 次に、スレッド割り当てスタックのうち、 `start_thread` の下にあるものが特に明らかになっています。この環境では、渡された `-Xmx` の値を考慮すると、Quarkusは12個のイベントループスレッドを作成します。それとは別に、6つの余分なスレッドがあります。これら18個のスレッドの名前は、すべて16文字を超えます。これは、 `ps` コマンドで確認することができます:

source: Second, you have to obtain the `InterceptionProxy` from the `SyntheticCreationalContext` in the `BeanCreator` and use it:
ja_jp: 次に、 `BeanCreator` の `SyntheticCreationalContext` から `InterceptionProxy` を取得して使用する必要があります。

source: Second: Locking in a find().
ja_jp: 2つ目: find()でロックする。

source: Seconds of auto refreshing certificate.
ja_jp: 証明書の自動更新の秒数。

source: Seconds of keeping alive interval for each client broker connection.
ja_jp: 各クライアント・ブローカー接続のキープアライブインターバルの秒数。

source: Secret Engines
ja_jp: シークレットエンジン

source: Secret Keys Expressions
ja_jp: シークレット・キー式

source: Secret engines
ja_jp: シークレットエンジン

source: Secret key supplied as a string.
ja_jp: 秘密鍵は文字列として提供されます。

source: Secret volumes
ja_jp: シークレットのVolume

source: SecretKey support
ja_jp: SecretKey のサポート

source: Secrets engines
ja_jp: シークレットエンジン

source: Secrets engines are components that store, generate, or encrypt data.
ja_jp: シークレットエンジンは、データを保存、生成、暗号化するコンポーネントです。

source: Secrets in Configuration
ja_jp: 設定のシークレット

source: Secrets in environment properties
ja_jp: 環境プロパティへのシークレットの保存

source: Section blocks can also define an optional end tag - `{/title}`.
ja_jp: セクションブロックは、オプションのエンドタグ (`{/title}`) を定義することもできます。

source: Section heading for the prerequisites
ja_jp: 前提条件のセクション見出し

source: Section titles should be written in sentence case rather than title case.
ja_jp: セクションのタイトルは、タイトル・ケースではなく、センテンス・ケースで記述してください。

source: Section titles should be written in sentence case, rather than title case.
ja_jp: セクションのタイトルは、タイトルケースではなく、センテンスケースで記述すること。

source: Sections
ja_jp: セクション

source: Secure HTTP access to Jakarta REST (formerly known as JAX-RS) endpoints in your application with Bearer token authentication by using the Quarkus OpenID Connect (OIDC) extension.
ja_jp: Quarkus OpenID Connect（OIDC）エクステンションを使用することで、ベアラートークン認証を使って、アプリケーション内のJakarta REST（旧称JAX-RS）エンドポイントへのHTTPアクセスを保護できます。

source: Secure HTTP upgrade
ja_jp: セキュア HTTP アップグレード

source: Secure HTTP upgrade with the `@AuthorizationPolicy` annotation
ja_jp: HTTP アップグレードの `@AuthorizationPolicy` アノテーションによる保護

source: Secure Jakarta Data repositories
ja_jp: Jakarta Data リポジトリーのセキュア化

source: Secure WebSocket endpoint callback methods
ja_jp: セキュアな WebSocket エンドポイントコールバックメソッド

source: Secure a Quarkus application with Basic authentication
ja_jp: ベーシック認証によるQuarkusアプリケーションの保護

source: Secure a Quarkus application with Basic authentication and Jakarta Persistence
ja_jp: Basic認証とJakarta Persistenceを使用したQuarkusアプリケーションの保護

source: Secure auto-generated resources by REST Data with Panache
ja_jp: 自動生成されたリソースをREST Data with Panacheで保護

source: Secure connections with SSL
ja_jp: SSLによる安全な接続

source: Secure connections with SSL/TLS
ja_jp: SSL/TLSによるセキュアな接続

source: Secure gRPC service
ja_jp: セキュアな gRPC サービス

source: Secure serialization
ja_jp: セキュア・シリアライゼーション

source: Secure server endpoints with permission checkers
ja_jp: 権限チェッカーでサーバーのエンドポイントを保護する

source: Secure the API endpoint to determine who can access the application by using one of the following approaches:
ja_jp: 次のいずれかの方法を使用して、API エンドポイントを保護し、アプリケーションにアクセスできるユーザーを決定します。

source: Secure the HTTP upgrade with the `HttpSecurityPolicy` named `custom`.
ja_jp: `custom` という名前の `HttpSecurityPolicy` を使用して HTTP アップグレードを保護します。

source: Secure your Quarkus application endpoints by combining Quarkus built-in basic HTTP authentication with the JPA identity provider to enable role-based access control (RBAC).
ja_jp: Quarkus組み込みのBasic HTTP認証とJPA IDプロバイダーを組み合わせることで、Quarkusアプリケーションのエンドポイントを保護し、ロールベースのアクセス制御（RBAC）を可能にします。

source: Secure your Quarkus application endpoints by combining the built-in Quarkus Basic authentication with the Jakarta Persistence identity provider to enable role-based access control (RBAC).
ja_jp: 組込のQuarkus Basic認証とJakarta Persistence IDプロバイダーを組み合わせて、ロールベースアクセス制御（RBAC）を可能にすることで、Quarkusアプリケーションエンドポイントを保護してください。

source: Secure your Quarkus application endpoints by combining xref:security-built-in-authentication.adoc#basic-auth[Quarkus built-in basic HTTP authentication] with the JPA identity provider to enable role-based access control (RBAC). The JPA `IdentityProvider` creates a `SecurityIdentity` instance, which is used during user authentication to verify and authorize access requests making your Quarkus application secure.
ja_jp: link:security-built-in-authentication.html#basic-auth[Quarkusに組み込まれたベーシックHTTP認証] とJPA IDプロバイダーを組み合わせて、ロールベースアクセス制御（RBAC）を有効にすることで、Quarkusアプリケーションのエンドポイントを保護できます。JPA `IdentityProvider` は `SecurityIdentity` インスタンスを作成します。このインスタンスは、ユーザー認証時に使用されて、アクセス要求の確認と承認が行われ、Quarkus アプリケーションのセキュリティが確保されます。

source: Secure your Quarkus application with WebAuthn authentication
ja_jp: WebAuthn 認証による Quarkus アプリケーションのセキュリティー確保

source: Secure your applications with JSON Web Token
ja_jp: JSON Web Token を使用してアプリケーションをセキュアにする

source: Secure your applications with OAuth2 opaque tokens
ja_jp: OAuth2 不透明トークンを使ってアプリケーションをセキュアにする

source: Secure your applications with OpenID Connect and Keycloak
ja_jp: OpenID Connect と Keycloak を使ってアプリケーションをセキュアにする

source: Secure your applications with username/password stored in a database
ja_jp: データベースに保存されたユーザー名/パスワードを使ってアプリケーションをセキュアにする

source: Secure your services
ja_jp: サービスをセキュアにする

source: Secure your web endpoints with authorizations.
ja_jp: 認可でウェブエンドポイントを保護

source: Secured with role-based access control (RBAC), this endpoint is accessible only to users with the `admin` role. Access is controlled declaratively by using the `@RolesAllowed` annotation.
ja_jp: ロールベースのアクセス制御 (RBAC) で保護されたこのエンドポイントには、 `admin` ロールを持つユーザーのみがアクセスできます。 アクセスは、 `@RolesAllowed` アノテーションを使用して宣言的に制御されます。

source: Securing Quarkus with commonly used OpenID Connect providers
ja_jp: 一般的に使用される OpenID Connect プロバイダーを使用して Quarkus を保護する

source: Securing Quarkus with commonly-used OpenID Connect providers
ja_jp: 一般的に使用されているOpenID ConnectプロバイダーによるQuarkusの保護

source: Securing endpoints
ja_jp: エンドポイントのセキュア化

source: Securing endpoints using @PermissionsAllowed annotation
ja_jp: `@PermissionsAllowed` アノテーションを使用したエンドポイントの保護

source: Securing the Ingress resource
ja_jp: Ingressリソースの保護

source: Securing the Route resource
ja_jp: Routeリソースの保護

source: Securing the endpoint
ja_jp: エンドポイントのセキュア化

source: Security
ja_jp: セキュリティ

source: Security Architecture and Guides
ja_jp: セキュリティーアーキテクチャとガイド

source: Security Customization
ja_jp: セキュリティのカスタマイズ

source: Security Identity Customization
ja_jp: セキュリティー・アイデンティティのカスタマイズ

source: Security Integration
ja_jp: セキュリティー統合

source: Security Overview
ja_jp: セキュリティの概要

source: Security Testing
ja_jp: セキュリティのテスト

source: Security Tips and Tricks
ja_jp: セキュリティに関するヒントとコツ

source: Security and authentication mechanisms in Quarkus
ja_jp: Quarkus のセキュリティーと認証メカニズム

source: Security annotations used during authentication must be placed on an endpoint class as well, for the `SecurityIdentity` is created before the websocket connection is opened.
ja_jp: 認証時に使用されるセキュリティアノテーションはエンドポイントクラスにも配置する必要があります。 `SecurityIdentity` はウェブソケット接続がオープンされる前に作成されます。

source: Security architecture
ja_jp: セキュリティ・アーキテクチャ

source: Security by Design:
ja_jp: 設計によるセキュリティ:

source: Security capabilities are provided by the Quarkus Security extension, therefore make sure your `pom.xml` file contains following dependency:
ja_jp: セキュリティー機能は Quarkus Security エクステンションによって提供されるため、 `pom.xml` ファイルに次の依存関係が含まれていることを確認してください。

source: Security capabilities are provided by the Quarkus Security extension. Any xref:security-identity-providers.adoc[Identity provider] can be used to convert authentication credentials on the initial HTTP request into a `SecurityIdentity` instance. The `SecurityIdentity` is then associated with the websocket connection. Authorization options are demonstrated in following sections.
ja_jp: セキュリティー機能は、Quarkus Security エクステンションによって提供されます。 任意の xref:security-identity-providers.adoc[アイデンティティープロバイダー] を使用して、最初の HTTP リクエストの認証情報を `SecurityIdentity` インスタンスに変換できます。 次に、 `SecurityIdentity` が Websocket 接続に関連付けられます。 認可オプションについては、次のセクションで説明します。

source: Security for the management endpoints exposed in the separate HTTP server needs to be enabled explicitly like in the example below:
ja_jp: 別の HTTP サーバーで公開される管理エンドポイントのセキュリティーは、次の例のように明示的に有効にする必要があります。

source: Security implications
ja_jp: セキュリティへの影響

source: Security vulnerability detection
ja_jp: セキュリティ脆弱性の検出

source: Security vulnerability detection and reporting in Quarkus
ja_jp: Quarkusにおけるセキュリティ脆弱性の検出と報告

source: Security with Basic authentication and JPA
ja_jp: Basic認証とJPAによるセキュリティ

source: Security worked out-of-the-box and was well defined (big win)
ja_jp: セキュリティはすぐに使えて、しっかりと定義されていた (大勝利)

source: Security&nbsp;policy
ja_jp: セキュリティ&nbsp;ポリシー

source: SecurityIdentity roles can be mapped from the verified JWT access tokens as follows:
ja_jp: SecurityIdentity ロールは、検証済みの JWT アクセストークンから以下のようにマッピングすることができます。

source: See link:{hibernate-search-docs-url}#backend-elasticsearch-indexlayout[this section of the reference documentation] for more information.
ja_jp: 詳細は、link:{hibernate-search-docs-url}#backend-elasticsearch-indexlayout[参照ドキュメントのこちらのセクション] を参照してください。

source: See link:{hibernate-search-docs-url}#configuration-background-failure-handling[this section of the reference documentation] for more information.
ja_jp: 詳細は、link:{hibernate-search-docs-url}#configuration-background-failure-handling[参照ドキュメントのこちらのセクション] を参照してください。

source: See link:{hibernate-search-docs-url}#indexing-plan-synchronization[this section of the reference documentation] for more information.
ja_jp: 詳細は、link:{hibernate-search-docs-url}#indexing-plan-synchronization[参照ドキュメントのこちらのセクション] を参照してください。

source: See <<analysis-configurer,this section of this guide>> for more information.
ja_jp: 詳細は、<<analysis-configurer,this section of this guide>> を参照してください。

source: See <<configuration-reference>> for more information.
ja_jp: 詳しくは、 <<configuration-reference>> を参照してください。

source: See <<configuration-reference>> for the exhaustive list of configuration options.
ja_jp: 設定オプションの完全なリストについては、<<configuration-reference>> を参照してください。

source: See <<custom-functions-and-types>>.
ja_jp: <<custom-functions-and-types>> を参照してください。

source: See <<customizing-the-vert-x-configuration>> to configure the Vert.x instance using a programmatic approach.
ja_jp: プログラム的なアプローチを使用して Vert.x インスタンスを設定する方法については、<<customizing-the-vert-x-configuration>> を参照してください。

source: See <<gc-logging,Native Memory Management GC Logging section>> for details.
ja_jp: 詳細は、<<gc-logging,Native Memory Management GC Logging section> を参照してください。

source: See <<hr-cdi-integration>> for details.
ja_jp: 詳細については、<<hr-cdi-integration>> を参照してください。

source: See <<interceptors>>.
ja_jp: <<interceptors>> を参照してください。

source: See <<json_xml_serialization_deserialization>>.
ja_jp: <<json_xml_serialization_deserialization>> を参照してください。

source: See <<keycloak-dev-mode, Running the Application in Dev mode>> section above about testing your application in a dev mode.
ja_jp: 開発モードでのアプリケーションのテストについては、上記の <<keycloak-dev-mode, 開発モードでのアプリケーションの実行>> セクションを参照してください。

source: See <<keycloak-dev-mode, Running the Application in Dev mode>> section above about testing your application in dev mode.
ja_jp: 開発モードでのアプリケーションのテストについては、上記の <<keycloak-dev-mode, 開発モードでのアプリケーションの実行>> セクションを参照してください。

source: See <<multitenancy>>.
ja_jp: <<multitenancy>> を参照してください。

source: See <<negotiation>> for more information.
ja_jp: 詳細は、<<negotiation>> を参照してください。

source: See <<other-databases>> if you want to use a JDBC driver for another database.
ja_jp: 別のデータベースに JDBC ドライバーを使用する場合は、<<other-databases>> を参照してください。

source: See <<parameter-mapping>> for more advanced use-cases.
ja_jp: より高度なユースケース向けについては、<<parameter-mapping>> を参照してください。

source: See <<programmatic-mapping,this section of this guide>> for more information.
ja_jp: 詳細は、<<programmatic-mapping,this section of this guide>> を参照してください。

source: See <<programmatically-resolving-tenants-connections>>.
ja_jp: <<programmatically-resolving-tenants-connections>> を参照してください。

source: See <<quarkus-hibernate-search-standalone-elasticsearch_quarkus-hibernate-search-standalone-mapping-structure,`quarkus.hibernate-search-standalone.mapping.structure`>> for other options and more details.
ja_jp: その他のオプションと詳細は、<<quarkus-hibernate-search-standalone-elasticsearch_quarkus-hibernate-search-standalone-mapping-structure,`quarkus.hibernate-search-standalone.mapping.structure`>> を参照してください。

source: See <<secure, above>>
ja_jp: xref:secure[上記] 参照

source: See <<statement_inspectors>>.
ja_jp: <<statement_inspectors>> を参照してください。

source: See <<subscribe-or-not-subscribe>> to learn more about subscribing to the `Uni`.
ja_jp: `Uni` への登録に関する詳細は、<<subscribe-or-not-subscribe>> を参照してください。

source: See <<subscribe-or-not-subscribe>> to learn more about subscribing to the incoming `Multi`.
ja_jp: 受信した `Multi` のサブスクライブに関する詳細は、<<subscribe-or-not-subscribe>> を参照してください。

source: See <<tip-quarkus-native-remote-container-build, Creating a Linux executable without GraalVM installed>> for more details.
ja_jp: 詳しくは <<tip-quarkus-native-remote-container-build, Linux実行可能ファイルをGraalVMをインストールせずに作成>> を参照して下さい。

source: See <<tip-quarkus-native-remote-container-build,Creating a Linux executable without GraalVM installed>> for more details.
ja_jp: 詳細は、<<tip-quarkus-native-remote-container-build,Creating a Linux executable without GraalVM installed>> を参照してください。

source: See <<uri-parameters,URI parameters>> for more information about URI mapping.
ja_jp: URI マッピングの詳細は、<<uri-parameters,URI parameters>> を参照してください。

source: See a list of these Qute value resolvers https://quarkus.io/guides/qute-reference#built-in-resolvers[here].
ja_jp: これらのQute値リゾルバの一覧は link:https://quarkus.io/guides/qute-reference#built-in-resolvers[こちら]をご覧ください。

source: See also <<getting-started-testing.adoc#test-from-ide,Running `@QuarkusTest` from an IDE>>.
ja_jp: <<getting-started-testing.adoc#test-from-ide,IDEからの `@QuarkusTest` の実行>> も参照して下さい。

source: See also <<quarkus-hibernate-search-orm-elasticsearch_quarkus-hibernate-search-orm-schema-management-strategy,`quarkus.hibernate-search-orm.schema-management.strategy`>>.
ja_jp: <<quarkus-hibernate-search-orm-elasticsearch_quarkus-hibernate-search-orm-schema-management-strategy,`quarkus.hibernate-search-orm.schema-management.strategy`>> も参照してください。

source: See also <<quarkus-hibernate-search-standalone-elasticsearch_quarkus-hibernate-search-standalone-schema-management-strategy,`quarkus.hibernate-search-standalone.schema-management.strategy`>>.
ja_jp: <<quarkus-hibernate-search-standalone-elasticsearch_quarkus-hibernate-search-standalone-schema-management-strategy,`quarkus.hibernate-search-standalone.schema-management.strategy`>> も参照してください。

source: See also link:#quarkus-hibernate-search-orm-elasticsearch_quarkus.hibernate-search-orm.schema-management.strategy[`quarkus.hibernate-search-orm.schema-management.strategy`].
ja_jp: link:#quarkus-hibernate-search-orm-elasticsearch_quarkus.hibernate-search-orm.schema-management.strategy[`quarkus.hibernate-search-orm.schema-management.strategy`] を参照してください。

source: See also the <<bearer-token-source-properties>> section for details about enabling a Demonstrating Proof of Possession (DPoP) binding.
ja_jp: Demonstrating Proof of Possession (DPoP) バインディングを有効にする方法の詳細は、 <<bearer-token-source-properties>> セクションも参照してください。

source: See also the <<client-credentials>> section for a complete description of supported OIDC provider client authentication options.
ja_jp: サポートされている OIDC プロバイダークライアント認証オプションの完全な説明については、 <<client-credentials>> セクションも参照してください。

source: See also the <<custom-certificate-validator>> section for details about providing additional certificate chain checks.
ja_jp: 追加の証明書チェーンチェックの提供に関する詳細は、 <<custom-certificate-validator>> セクションも参照してください。

source: See also the <<custom-jose4j-validator>> section for details about customizing the JWT token verification.
ja_jp: JWT トークン検証のカスタマイズについての詳細は、 <<custom-jose4j-validator>> セクションも参照してください。

source: See also the <<custom-token-introspection-cache>> and <<custom-user-info-cache>> sections for details about customizing both the token introspection and `UserInfo` result caches.
ja_jp: トークンイントロスペクションと `UserInfo` 結果キャッシュの両方のカスタマイズについての詳細は、 <<custom-token-introspection-cache>> および <<custom-user-info-cache>> セクションも参照してください。

source: See also the <<customize-authentication-requests>> section for information on configuring additional query parameters for the OIDC authorization endpoint.
ja_jp: OIDC 認可エンドポイントの追加クエリーパラメーターを設定する方法については、 <<customize-authentication-requests>> セクションも参照してください。

source: See also the <<customize-authentication-requests>> section how to configure additional query parameters for OIDC authorization point.
ja_jp: OIDC 認可ポイントの追加クエリーパラメーターを設定する方法については、<<customize-authentication-requests>> セクションも参照してください。

source: See also the <<jwt-authentication-headers-claims>> section below for details about customizing the generated JWT token.
ja_jp: 生成された JWT トークンのカスタマイズに関する詳細は、以下の <<jwt-authentication-headers-claims>> セクションも参照してください。

source: See also the <<oidc-metadata-properties>> for details about the OIDC provider metadata that Quarkus OIDC uses for its work.
ja_jp: Quarkus OIDC が動作に使用する OIDC プロバイダーのメタデータの詳細については、 <<oidc-metadata-properties>> も参照してください。

source: See also the <<oidc-redirect-filters>> section explaining how a custom `OidcRedirectFilter` can be used to customize OIDC redirects, including those to the OIDC authorization endpoint.
ja_jp: また、カスタムの `OidcRedirectFilter` を使用して、OIDC 認可エンドポイントへのリダイレクトを含む OIDC リダイレクトをカスタマイズする方法については、<<oidc-redirect-filters>> セクションを参照してください。

source: See also the <<oidc-redirect-filters>> section explaining how a custom `OidcRedirectFilter` can be used to customize OIDC redirects, including those to the session expired pages.
ja_jp: また、カスタムの `OidcRedirectFilter` を使用して、セッション期限切れページへのリダイレクトを含む OIDC リダイレクトをカスタマイズする方法については、<<oidc-redirect-filters>> セクションを参照してください。

source: See also the <<permission-based-access-control>> section below.
ja_jp: 以下の <<permission-based-access-control>> セクションも参照してください。
